In [3]:
import pandas as pd

# Updated sample data with different datetime strings
data = [
    "2025-07-19 11:43",
    "2025-07-18 09:15",
    "2025-07-17 14:30",
    "2025-07-16 22:00",
    "2025-07-15 08:05"
]

info = {"D_T": data}
x = pd.DataFrame(info)
print(x)

                D_T
0  2025-07-19 11:43
1  2025-07-18 09:15
2  2025-07-17 14:30
3  2025-07-16 22:00
4  2025-07-15 08:05

In [9]:
print(x["D_T"])

0    2025-07-19 11:43
1    2025-07-18 09:15
2    2025-07-17 14:30
3    2025-07-16 22:00
4    2025-07-15 08:05
Name: D_T, dtype: object

In [19]:
x["D_T"]=pd.to_datetime(x["D_T"])

In [87]:
# separate columns 
x["Year"] = x["D_T"].dt.year # year column created 
x["month"] = x["D_T"].dt.month # month column created 
x["day"] = x["D_T"].dt.day # day column created 
x["date"] = x["D_T"].dt.date # date column created 
x["hour"] = x["D_T"].dt.hour # hour column created 
x["minute"] = x["D_T"].dt.minute # minute column created 
x["weekday"] = x["D_T"].dt.weekday # weekday column created 
x["dayname"] = x["D_T"].dt.day_name() # day_name() column created

In [89]:
x

,D_T,Year,month,date,day,hour,minute,weekday,dayname
0,2025-07-19 11:43:00,2025,7,2025-07-19,19,11,43,5,Saturday
1,2025-07-18 09:15:00,2025,7,2025-07-18,18,9,15,4,Friday
2,2025-07-17 14:30:00,2025,7,2025-07-17,17,14,30,3,Thursday
3,2025-07-16 22:00:00,2025,7,2025-07-16,16,22,0,2,Wednesday
4,2025-07-15 08:05:00,2025,7,2025-07-15,15,8,5,1,Tuesday

In [95]:
# how to find duplicates

name = ["A" , "B" , "C" , "D" , "A" , "B"]
age = [23,53,24,12,35,35]
details = {"Name": name , "AGE" : age}

y = pd.DataFrame(details)

In [97]:
y

  Name  AGE
0    A   23
1    B   53
2    C   24
3    D   12
4    A   35
5    B   35

In [129]:
print(y.duplicated())
print()
print()
print(y.duplicated(subset="Name"))
print()
print()
print(y.duplicated(subset="AGE"))

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool


0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool


0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [131]:
y

  Name  AGE
0    A   23
1    B   53
2    C   24
3    D   12
4    A   35
5    B   35

In [142]:
print(y.drop_duplicates("Name"))

  Name  AGE
0    A   23
1    B   53
2    C   24
3    D   12